import useSwipeDown from "@/utils/swipeDown";
import React, { forwardRef, useImperativeHandle, useRef } from "react";

const TermAndConditionModal = forwardRef((_, ref) => {
  const modalRef = useRef<HTMLDialogElement>(null);

  useImperativeHandle(ref, () => ({
    openModal: () => modalRef.current?.showModal(),
    closeModal: () => modalRef.current?.close(),
  }));

  const swipeDownHandlers = useSwipeDown(() => modalRef.current?.close());

  return (
    <dialog ref={modalRef} id="my_modal_1" className="modal">
      <div className="modal-box max-w-[500px] p-0 relative modal-vehicle-pick overflow-hidden flex flex-col max-h-[90vh]">
        <div className="bottom-sheet" {...swipeDownHandlers}>
          <div className="bottom-sheet-icon"></div>
        </div>
        <div className="modal-header bg-white sticky top-0 flex justify-between z-10">
          <div className="modal-title">
            เงื่อนไข หลักเกณฑ์ และระเบียบการใช้ยานพาหนะ
          </div>
          <form method="dialog">
            <button className="close btn btn-icon border-none bg-transparent shadow-none btn-tertiary">
              <i className="material-symbols-outlined">close</i>
            </button>
          </form>
        </div>
        <div className="modal-body overflow-y-auto px-6 py-4 leading-7 whitespace-pre-line">
          <p className="text-justify">
            โปรดอ่านข้อตกลงการใช้งานเว็บไซต์นี้อย่างระมัดระวัง
            เนื่องจากข้อตกลงต่อไปนี้มีผลผูกพันทางกฎหมาย
            ระหว่างท่านและการไฟฟ้าส่วนภูมิภาคและใช้บังคับกับการใช้งานเว็บไซต์นี้และข้อมูลที่ระบุไว้ในเว็บไซต์นี้{" "}
            <br></br>
            การยอมรับข้อตกลงการใช้งานเว็บไซต์และการใช้งานเว็บไซต์นี้ท่านรับทราบว่าท่านได้อ่านและเข้าใจข้อตกลงการใช้งานเว็บไซต์และท่านตกลงที่จะผูกพัน
            และปฏิบัติตามข้อตกลงการใช้งานเว็บไซต์นี้
            โปรดอย่าใช้งานเว็บไซต์นี้หากท่านไม่ตกลงที่จะผูกพันตามข้อตกลงการใช้งานนี้{" "}
            <br></br>
            ข้อตกลงระหว่างท่านและบริษัทเว็บไซต์ของบริษัทอาจประกอบด้วยเว็บไซต์
            หรือ เว็บเพจต่างๆ ที่ดำเนินการโดยบริษัท ซึ่งมีสำนักงานใหญ่ตั้งอยู่
            เลขที่ 200 ถนนงามวงศ์วาน แขวงลาดยาว เขตจตุจักร กทม. 10900
            (เว็บไซต์และเว็บเพจทั้งหมดนี้จะรวมเรียกว่า "เว็บไซต์ของบริษัท")
            การใช้งานเว็บไซต์ของบริษัทอยู่ภายใต้เงื่อนไขว่าท่านจะต้องตกลงและยอมรับ
            ข้อตกลง การใช้งานเว็บไซต์นี้ โดยไม่แก้ไขประการใดทั้งสิ้น
            การที่ท่านใช้งานเว็บไซต์ของบริษัท
            ย่อมก่อให้เกิดความผูกพันทางกฎหมายตามข้อกำหนดที่ระบุไว้ในข้อตกลงการใช้งานเว็บไซต์
            หากท่านไม่ยอมรับข้อตกลงการใช้งานเว็บไซต์นี้
            โปรดอย่าเข้าสู่และใช้งานเว็บไซต์ของบริษัท การแก้ไข
            เปลี่ยนแปลงข้อตกลงการใช้งานเว็บไซต์นี้บริษัทขอสงวนสิทธิที่จะแก้ไขหรือเปลี่ยนแปลงข้อตกลงการใช้งานที่ระบุไว้ในเว็บไซต์นี้{" "}
            <br></br>
            ท่านมีหน้าที่ตรวจสอบข้อตกลงการใช้งานเว็บไซต์นี้
            รวมถึงข้อกำหนดเพิ่มเติมใดๆ
            ที่ระบุไว้ในเว็บไซต์ของบริษัทอย่างสม่ำเสมอ
            การที่ท่านใช้งานเว็บไซต์ของบริษัทอย่างต่อเนื่องย่อมถือว่า
            ท่านรับทราบและตกลงตามข้อตกลงการใช้งานที่ได้แก้ไขหรือเปลี่ยนแปลงนั้นแล้ว
            การใช้และการเปิดเผยข้อมูลส่วนบุคคลเว้นแต่กฎหมายที่ใช้บังคับจะกำหนดเป็นอย่างอื่น{" "}
            <br></br>
            ท่านตกลงและ
            ยอมรับว่าข้อมูลส่วนบุคคลของท่านทั้งหมดที่บริษัทเก็บรวบรวมจากเว็บไซต์ของบริษัทอาจถูกใช้เพื่อ
            ประกอบการทำธุรกรรมและ/หรือการใช้บริการของท่าน
            รวมถึงเพื่อวัตถุประสงค์ในการวิเคราะห์ข้อมูล เสนอ ให้ ใช้
            และ/หรือปรับปรุงผลิตภัณฑ์หรือบริการต่างๆ ของบริษัท
            และ/หรือเพื่อตรวจสอบราย การธุรกรรม
            รวมทั้งอาจถูกเปิดเผยให้แก่บริษัทในกลุ่มธุรกิจทางการเงิน ผู้สอบบัญชี
            ผู้ตรวจสอบ ภายนอก สถาบันการเงิน หน่วยงานราชการ
            ผู้รับโอนสิทธิเรียกร้อง และ/หรือนิติบุคคลหรือบุคคลใดๆ
            ที่บริษัทได้รับความยินยอมจากท่านให้เปิดเผยข้อมูลดังกล่าว <br></br>
            โปรดศึกษานโยบายการรักษาความปลอดภัยของบริษัทเพิ่มเติมการเชื่อมต่อกับเว็บไซต์อื่นๆ
            บริษัทอาจเชื่อมต่อเว็บไซต์นี้กับเว็บไซต์อื่นๆ
            ที่ไม่ได้อยู่ภายใต้การควบคุมดูแลของบริษัทเพื่อให้ข้อมูลและอำนวยความสะดวกแก่ท่านเท่านั้น
            การที่ท่านเข้าสู่เว็บไซต์เหล่านั้นย่อมเป็นความเสี่ยงของท่านและบริษัทจะไม่รับผิดชอบต่อความเสียหายใดๆ
            ที่เกิดขึ้นจากการกระทำของท่านที่เกี่ยวข้องกับข้อมูล สินค้า
            หรือบริการที่แสดงหรือเสนอบนเว็บไซต์ของบุคคลภายนอกใดๆ
            ที่เชื่อมต่อกับเว็บไซต์ของบริษัท ไม่ว่าในกรณีใดๆ ทั้งสิ้น <br></br>
            ทั้งนี้ บริษัทไม่ให้คำรับประกัน คำรับรองหรือคำแนะนำใดๆ
            ที่เกี่ยวข้องกับข้อมูล
            สินค้าหรือบริการใดๆที่ปรากฏอยู่บนเว็บไซต์ของบุคคลภายนอกดังกล่าวและบริษัทจะไม่รับผิดชอบต่อ
            ความบกพร่องหรือการผิดสัญญาใดๆ ที่เกี่ยวข้องกับสินค้า หรือบริการใดๆ
            ที่ปรากฏหรือโฆษณาบน เว็บไซต์เหล่านั้น
            บริษัทไม่มีข้อตกลงหรือสัญญาใดๆกับเว็บไซต์อื่นดังกล่าวที่เกี่ยวข้องกับข้อตกลง
            ของท่านกับเว็บไซต์อื่นดังกล่าวนั้น <br></br>
          </p>
        </div>
        <div className="modal-action sticky bottom-0 gap-3 mt-0">
          <form method="dialog">
            <button className="btn btn-primary">ยืนยัน</button>
          </form>
        </div>
      </div>
      <form method="dialog" className="modal-backdrop">
        <button>close</button>
      </form>
    </dialog>
  );
});

TermAndConditionModal.displayName = "TermAndConditionModal";

export default TermAndConditionModal;
